mikeakohn/naken_asm/include/dspic/p33fj06gs101.inc
; Convert Microchip include files to naken_asm readable.

__FBS equ 0xF80000
__FGS equ 0xF80004
__FOSCSEL equ 0xF80006
__FOSC equ 0xF80008
__FWDT equ 0xF8000A
__FPOR equ 0xF8000C
__FICD equ 0xF8000E
__FUID0 equ 0xF80010
__FUID1 equ 0xF80012
__NO_HANDLES equ 1;          /* Suppress handles on this device  */
__IVT_BASE  equ 0x4
__AIVT_BASE equ 0x104
__DATA_BASE equ 0x800
__DATA_LENGTH equ 0x100
__YDATA_BASE equ 0x880
__CODE_BASE equ 0x200
__CODE_LENGTH equ 0xE00
_WREG0        equ 0x0
WREG1        equ 0x2
_WREG1        equ 0x2
WREG2        equ 0x4
_WREG2        equ 0x4
WREG3        equ 0x6
_WREG3        equ 0x6
WREG4        equ 0x8
_WREG4        equ 0x8
WREG5        equ 0xA
_WREG5        equ 0xA
WREG6        equ 0xC
_WREG6        equ 0xC
WREG7        equ 0xE
_WREG7        equ 0xE
WREG8        equ 0x10
_WREG8        equ 0x10
WREG9        equ 0x12
_WREG9        equ 0x12
WREG10       equ 0x14
_WREG10       equ 0x14
WREG11       equ 0x16
_WREG11       equ 0x16
WREG12       equ 0x18
_WREG12       equ 0x18
WREG13       equ 0x1A
_WREG13       equ 0x1A
WREG14       equ 0x1C
_WREG14       equ 0x1C
WREG15       equ 0x1E
_WREG15       equ 0x1E
SPLIM        equ 0x20
_SPLIM        equ 0x20
ACCAL        equ 0x22
_ACCAL        equ 0x22
ACCAH        equ 0x24
_ACCAH        equ 0x24
ACCAU        equ 0x26
_ACCAU        equ 0x26
ACCBL        equ 0x28
_ACCBL        equ 0x28
ACCBH        equ 0x2A
_ACCBH        equ 0x2A
ACCBU        equ 0x2C
_ACCBU        equ 0x2C
PCL          equ 0x2E
_PCL          equ 0x2E
PCH          equ 0x30
_PCH          equ 0x30
TBLPAG       equ 0x32
_TBLPAG       equ 0x32
PSVPAG       equ 0x34
_PSVPAG       equ 0x34
RCOUNT       equ 0x36
_RCOUNT       equ 0x36
DCOUNT       equ 0x38
_DCOUNT       equ 0x38
DOSTARTL     equ 0x3A
_DOSTARTL     equ 0x3A
DOSTARTH     equ 0x3C
_DOSTARTH     equ 0x3C
DOENDL       equ 0x3E
_DOENDL       equ 0x3E
DOENDH       equ 0x40
_DOENDH       equ 0x40
SR           equ 0x42
_SR           equ 0x42
_SRbits       equ 0x42
CORCON       equ 0x44
_CORCON       equ 0x44
_CORCONbits   equ 0x44
MODCON       equ 0x46
_MODCON       equ 0x46
_MODCONbits   equ 0x46
XMODSRT      equ 0x48
_XMODSRT      equ 0x48
XMODEND      equ 0x4A
_XMODEND      equ 0x4A
YMODSRT      equ 0x4C
_YMODSRT      equ 0x4C
YMODEND      equ 0x4E
_YMODEND      equ 0x4E
XBREV        equ 0x50
_XBREV        equ 0x50
_XBREVbits    equ 0x50
DISICNT      equ 0x52
_DISICNT      equ 0x52
CNEN1        equ 0x60
_CNEN1        equ 0x60
_CNEN1bits    equ 0x60
CNPU1        equ 0x68
_CNPU1        equ 0x68
_CNPU1bits    equ 0x68
INTCON1      equ 0x80
_INTCON1      equ 0x80
_INTCON1bits  equ 0x80
INTCON2      equ 0x82
_INTCON2      equ 0x82
_INTCON2bits  equ 0x82
IFS0         equ 0x84
_IFS0         equ 0x84
_IFS0bits     equ 0x84
IFS1         equ 0x86
_IFS1         equ 0x86
_IFS1bits     equ 0x86
IFS3         equ 0x8A
_IFS3         equ 0x8A
_IFS3bits     equ 0x8A
IFS4         equ 0x8C
_IFS4         equ 0x8C
_IFS4bits     equ 0x8C
IFS5         equ 0x8E
_IFS5         equ 0x8E
_IFS5bits     equ 0x8E
IFS6         equ 0x90
_IFS6         equ 0x90
_IFS6bits     equ 0x90
IFS7         equ 0x92
_IFS7         equ 0x92
_IFS7bits     equ 0x92
IEC0         equ 0x94
_IEC0         equ 0x94
_IEC0bits     equ 0x94
IEC1         equ 0x96
_IEC1         equ 0x96
_IEC1bits     equ 0x96
IEC3         equ 0x9A
_IEC3         equ 0x9A
_IEC3bits     equ 0x9A
IEC4         equ 0x9C
_IEC4         equ 0x9C
_IEC4bits     equ 0x9C
IEC5         equ 0x9E
_IEC5         equ 0x9E
_IEC5bits     equ 0x9E
IEC6         equ 0xA0
_IEC6         equ 0xA0
_IEC6bits     equ 0xA0
IEC7         equ 0xA2
_IEC7         equ 0xA2
_IEC7bits     equ 0xA2
IPC0         equ 0xA4
_IPC0         equ 0xA4
_IPC0bits     equ 0xA4
IPC1         equ 0xA6
_IPC1         equ 0xA6
_IPC1bits     equ 0xA6
IPC2         equ 0xA8
_IPC2         equ 0xA8
_IPC2bits     equ 0xA8
IPC3         equ 0xAA
_IPC3         equ 0xAA
_IPC3bits     equ 0xAA
IPC4         equ 0xAC
_IPC4         equ 0xAC
_IPC4bits     equ 0xAC
IPC5         equ 0xAE
_IPC5         equ 0xAE
_IPC5bits     equ 0xAE
IPC7         equ 0xB2
_IPC7         equ 0xB2
_IPC7bits     equ 0xB2
IPC14        equ 0xC0
_IPC14        equ 0xC0
_IPC14bits    equ 0xC0
IPC16        equ 0xC4
_IPC16        equ 0xC4
_IPC16bits    equ 0xC4
IPC23        equ 0xD2
_IPC23        equ 0xD2
_IPC23bits    equ 0xD2
IPC24        equ 0xD4
_IPC24        equ 0xD4
_IPC24bits    equ 0xD4
IPC27        equ 0xDA
_IPC27        equ 0xDA
_IPC27bits    equ 0xDA
IPC28        equ 0xDC
_IPC28        equ 0xDC
_IPC28bits    equ 0xDC
INTTREG      equ 0xE0
_INTTREG      equ 0xE0
_INTTREGbits  equ 0xE0
TMR1         equ 0x100
_TMR1         equ 0x100
PR1          equ 0x102
_PR1          equ 0x102
T1CON        equ 0x104
_T1CON        equ 0x104
_T1CONbits    equ 0x104
TMR2         equ 0x106
_TMR2         equ 0x106
PR2          equ 0x10C
_PR2          equ 0x10C
T2CON        equ 0x110
_T2CON        equ 0x110
_T2CONbits    equ 0x110
OC1RS        equ 0x180
_OC1RS        equ 0x180
OC1R         equ 0x182
_OC1R         equ 0x182
OC1CON       equ 0x184
_OC1CON       equ 0x184
_OC1CONbits   equ 0x184
I2C1RCV      equ 0x200
_I2C1RCV      equ 0x200
I2CRCV       equ 0x200
_I2CRCV       equ 0x200
I2C1TRN      equ 0x202
_I2C1TRN      equ 0x202
I2CTRN       equ 0x202
_I2CTRN       equ 0x202
I2C1BRG      equ 0x204
_I2C1BRG      equ 0x204
I2C1CON      equ 0x206
_I2C1CON      equ 0x206
_I2C1CONbits  equ 0x206
I2CCON       equ 0x206
_I2CCON       equ 0x206
_I2CCONbits   equ 0x206
I2C1STAT     equ 0x208
_I2C1STAT     equ 0x208
_I2C1STATbits equ 0x208
I2CSTAT      equ 0x208
_I2CSTAT      equ 0x208
_I2CSTATbits  equ 0x208
I2C1ADD      equ 0x20A
_I2C1ADD      equ 0x20A
I2CADD       equ 0x20A
_I2CADD       equ 0x20A
I2C1MSK      equ 0x20C
_I2C1MSK      equ 0x20C
U1MODE       equ 0x220
_U1MODE       equ 0x220
_U1MODEbits   equ 0x220
U1STA        equ 0x222
_U1STA        equ 0x222
_U1STAbits    equ 0x222
U1TXREG      equ 0x224
_U1TXREG      equ 0x224
_U1TXREGbits  equ 0x224
U1RXREG      equ 0x226
_U1RXREG      equ 0x226
_U1RXREGbits  equ 0x226
U1BRG        equ 0x228
_U1BRG        equ 0x228
SPI1STAT     equ 0x240
_SPI1STAT     equ 0x240
_SPI1STATbits equ 0x240
SPI1CON1     equ 0x242
_SPI1CON1     equ 0x242
_SPI1CON1bits equ 0x242
SPI1CON2     equ 0x244
_SPI1CON2     equ 0x244
_SPI1CON2bits equ 0x244
SPI1BUF      equ 0x248
_SPI1BUF      equ 0x248
TRISA        equ 0x2C0
_TRISA        equ 0x2C0
_TRISAbits    equ 0x2C0
PORTA        equ 0x2C2
_PORTA        equ 0x2C2
_PORTAbits    equ 0x2C2
LATA         equ 0x2C4
_LATA         equ 0x2C4
_LATAbits     equ 0x2C4
ODCA         equ 0x2C6
_ODCA         equ 0x2C6
_ODCAbits     equ 0x2C6
TRISB        equ 0x2C8
_TRISB        equ 0x2C8
_TRISBbits    equ 0x2C8
PORTB        equ 0x2CA
_PORTB        equ 0x2CA
_PORTBbits    equ 0x2CA
LATB         equ 0x2CC
_LATB         equ 0x2CC
_LATBbits     equ 0x2CC
ODCB         equ 0x2CE
_ODCB         equ 0x2CE
_ODCBbits     equ 0x2CE
ADCON        equ 0x300
_ADCON        equ 0x300
_ADCONbits    equ 0x300
ADPCFG       equ 0x302
_ADPCFG       equ 0x302
_ADPCFGbits   equ 0x302
ADSTAT       equ 0x306
_ADSTAT       equ 0x306
_ADSTATbits   equ 0x306
ADBASE       equ 0x308
_ADBASE       equ 0x308
ADCPC0       equ 0x30A
_ADCPC0       equ 0x30A
_ADCPC0bits   equ 0x30A
ADCPC1       equ 0x30C
_ADCPC1       equ 0x30C
_ADCPC1bits   equ 0x30C
ADCBUF0      equ 0x320
_ADCBUF0      equ 0x320
ADCBUF1      equ 0x322
_ADCBUF1      equ 0x322
ADCBUF2      equ 0x324
_ADCBUF2      equ 0x324
ADCBUF3      equ 0x326
_ADCBUF3      equ 0x326
ADCBUF6      equ 0x32C
_ADCBUF6      equ 0x32C
ADCBUF7      equ 0x32E
_ADCBUF7      equ 0x32E
PTCON        equ 0x400
_PTCON        equ 0x400
_PTCONbits    equ 0x400
PTCON2       equ 0x402
_PTCON2       equ 0x402
_PTCON2bits   equ 0x402
PTPER        equ 0x404
_PTPER        equ 0x404
SEVTCMP      equ 0x406
_SEVTCMP      equ 0x406
MDC          equ 0x40A
_MDC          equ 0x40A
PWMCON1      equ 0x420
_PWMCON1      equ 0x420
_PWMCON1bits  equ 0x420
IOCON1       equ 0x422
_IOCON1       equ 0x422
_IOCON1bits   equ 0x422
FCLCON1      equ 0x424
_FCLCON1      equ 0x424
_FCLCON1bits  equ 0x424
PDC1         equ 0x426
_PDC1         equ 0x426
PHASE1       equ 0x428
_PHASE1       equ 0x428
DTR1         equ 0x42A
_DTR1         equ 0x42A
ALTDTR1      equ 0x42C
_ALTDTR1      equ 0x42C
SDC1         equ 0x42E
_SDC1         equ 0x42E
SPHASE1      equ 0x430
_SPHASE1      equ 0x430
TRIG1        equ 0x432
_TRIG1        equ 0x432
_TRIG1bits    equ 0x432
TRGCON1      equ 0x434
_TRGCON1      equ 0x434
_TRGCON1bits  equ 0x434
STRIG1       equ 0x436
_STRIG1       equ 0x436
_STRIG1bits   equ 0x436
PWMCAP1      equ 0x438
_PWMCAP1      equ 0x438
_PWMCAP1bits  equ 0x438
LEBCON1      equ 0x43A
_LEBCON1      equ 0x43A
_LEBCON1bits  equ 0x43A
PWMCON4      equ 0x480
_PWMCON4      equ 0x480
_PWMCON4bits  equ 0x480
IOCON4       equ 0x482
_IOCON4       equ 0x482
_IOCON4bits   equ 0x482
FCLCON4      equ 0x484
_FCLCON4      equ 0x484
_FCLCON4bits  equ 0x484
PDC4         equ 0x486
_PDC4         equ 0x486
PHASE4       equ 0x488
_PHASE4       equ 0x488
DTR4         equ 0x48A
_DTR4         equ 0x48A
ALTDTR4      equ 0x48C
_ALTDTR4      equ 0x48C
SDC4         equ 0x48E
_SDC4         equ 0x48E
SPHASE4      equ 0x490
_SPHASE4      equ 0x490
TRIG4        equ 0x492
_TRIG4        equ 0x492
_TRIG4bits    equ 0x492
TRGCON4      equ 0x494
_TRGCON4      equ 0x494
_TRGCON4bits  equ 0x494
STRIG4       equ 0x496
_STRIG4       equ 0x496
_STRIG4bits   equ 0x496
PWMCAP4      equ 0x498
_PWMCAP4      equ 0x498
LEBCON4      equ 0x49A
_LEBCON4      equ 0x49A
_LEBCON4bits  equ 0x49A
RPINR0       equ 0x680
_RPINR0       equ 0x680
_RPINR0bits   equ 0x680
RPINR1       equ 0x682
_RPINR1       equ 0x682
_RPINR1bits   equ 0x682
RPINR2       equ 0x684
_RPINR2       equ 0x684
_RPINR2bits   equ 0x684
RPINR3       equ 0x686
_RPINR3       equ 0x686
_RPINR3bits   equ 0x686
RPINR11      equ 0x696
_RPINR11      equ 0x696
_RPINR11bits  equ 0x696
RPINR18      equ 0x6A4
_RPINR18      equ 0x6A4
_RPINR18bits  equ 0x6A4
RPINR20      equ 0x6A8
_RPINR20      equ 0x6A8
_RPINR20bits  equ 0x6A8
RPINR21      equ 0x6AA
_RPINR21      equ 0x6AA
_RPINR21bits  equ 0x6AA
RPINR29      equ 0x6BA
_RPINR29      equ 0x6BA
_RPINR29bits  equ 0x6BA
RPINR30      equ 0x6BC
_RPINR30      equ 0x6BC
_RPINR30bits  equ 0x6BC
RPINR31      equ 0x6BE
_RPINR31      equ 0x6BE
_RPINR31bits  equ 0x6BE
RPINR32      equ 0x6C0
_RPINR32      equ 0x6C0
_RPINR32bits  equ 0x6C0
RPINR33      equ 0x6C2
_RPINR33      equ 0x6C2
_RPINR33bits  equ 0x6C2
RPINR34      equ 0x6C4
_RPINR34      equ 0x6C4
_RPINR34bits  equ 0x6C4
RPOR0        equ 0x6D0
_RPOR0        equ 0x6D0
_RPOR0bits    equ 0x6D0
RPOR1        equ 0x6D2
_RPOR1        equ 0x6D2
_RPOR1bits    equ 0x6D2
RPOR2        equ 0x6D4
_RPOR2        equ 0x6D4
_RPOR2bits    equ 0x6D4
RPOR3        equ 0x6D6
_RPOR3        equ 0x6D6
_RPOR3bits    equ 0x6D6
RPOR16       equ 0x6F0
_RPOR16       equ 0x6F0
_RPOR16bits   equ 0x6F0
RPOR17       equ 0x6F2
_RPOR17       equ 0x6F2
_RPOR17bits   equ 0x6F2
RCON         equ 0x740
_RCON         equ 0x740
_RCONbits     equ 0x740
OSCCON       equ 0x742
_OSCCON       equ 0x742
_OSCCONbits   equ 0x742
OSCCONL      equ 0x742
_OSCCONL      equ 0x742
OSCCONH      equ 0x743
_OSCCONH      equ 0x743
CLKDIV       equ 0x744
_CLKDIV       equ 0x744
_CLKDIVbits   equ 0x744
PLLFBD       equ 0x746
_PLLFBD       equ 0x746
_PLLFBDbits   equ 0x746
OSCTUN       equ 0x748
_OSCTUN       equ 0x748
_OSCTUNbits   equ 0x748
LFSR         equ 0x74C
_LFSR         equ 0x74C
REFOCON      equ 0x74E
_REFOCON      equ 0x74E
_REFOCONbits  equ 0x74E
ACLKCON      equ 0x750
_ACLKCON      equ 0x750
_ACLKCONbits  equ 0x750
NVMCON       equ 0x760
_NVMCON       equ 0x760
_NVMCONbits   equ 0x760
NVMKEY       equ 0x766
_NVMKEY       equ 0x766
PMD1         equ 0x770
_PMD1         equ 0x770
_PMD1bits     equ 0x770
PMD2         equ 0x772
_PMD2         equ 0x772
_PMD2bits     equ 0x772
PMD4         equ 0x776
_PMD4         equ 0x776
_PMD4bits     equ 0x776
PMD6         equ 0x77A
_PMD6         equ 0x77A
_PMD6bits     equ 0x77A
ACCA         equ 0x22
_ACCA         equ 0x22
ACCB         equ 0x28
_ACCB         equ 0x28
OC1          equ 0x180
_OC1          equ 0x180
SPI1         equ 0x240
_SPI1         equ 0x240
UART1        equ 0x220
_UART1        equ 0x220
  WREG0L equ  _WREG0
  WREG0H equ  _WREG0+1
  WREG1L equ  _WREG1
  WREG1H equ  _WREG1+1
  WREG2L equ  _WREG2
  WREG2H equ  _WREG2+1
  WREG3L equ  _WREG3
  WREG3H equ  _WREG3+1
  WREG4L equ  _WREG4
  WREG4H equ  _WREG4+1
  WREG5L equ  _WREG5
  WREG5H equ  _WREG5+1
  WREG6L equ  _WREG6
  WREG6H equ  _WREG6+1
  WREG7L equ  _WREG7
  WREG7H equ  _WREG7+1
  WREG8L equ  _WREG8
  WREG8H equ  _WREG8+1
  WREG9L equ  _WREG9
  WREG9H equ  _WREG9+1
  WREG10L equ  _WREG10
  WREG10H equ  _WREG10+1
  WREG11L equ  _WREG11
  WREG11H equ  _WREG11+1
  WREG12L equ  _WREG12
  WREG12H equ  _WREG12+1
  WREG13L equ  _WREG13
  WREG13H equ  _WREG13+1
  WREG14L equ  _WREG14
  WREG14H equ  _WREG14+1
  WREG15L equ  _WREG15
  WREG15H equ  _WREG15+1
  SPLIML equ  _SPLIM
  SPLIMH equ  _SPLIM+1
  ACCALL equ  _ACCAL
  ACCALH equ  _ACCAL+1
  ACCAHL equ  _ACCAH
  ACCAHH equ  _ACCAH+1
  ACCAUL equ  _ACCAU
  ACCAUH equ  _ACCAU+1
  ACCBLL equ  _ACCBL
  ACCBLH equ  _ACCBL+1
  ACCBHL equ  _ACCBH
  ACCBHH equ  _ACCBH+1
  ACCBUL equ  _ACCBU
  ACCBUH equ  _ACCBU+1
  PCLL equ  _PCL
  PCLH equ  _PCL+1
  PCHL equ  _PCH
  PCHH equ  _PCH+1
  TBLPAGL equ  _TBLPAG
  TBLPAGH equ  _TBLPAG+1
  PSVPAGL equ  _PSVPAG
  PSVPAGH equ  _PSVPAG+1
  RCOUNTL equ  _RCOUNT
  RCOUNTH equ  _RCOUNT+1
  DCOUNTL equ  _DCOUNT
  DCOUNTH equ  _DCOUNT+1
  DOSTARTLL equ  _DOSTARTL
  DOSTARTLH equ  _DOSTARTL+1
  DOSTARTHL equ  _DOSTARTH
  DOSTARTHH equ  _DOSTARTH+1
  DOENDLL equ  _DOENDL
  DOENDLH equ  _DOENDL+1
  DOENDHL equ  _DOENDH
  DOENDHH equ  _DOENDH+1
  SRL equ  _SR
  SRH equ  _SR+1
  CORCONL equ  _CORCON
  CORCONH equ  _CORCON+1
  MODCONL equ  _MODCON
  MODCONH equ  _MODCON+1
  XMODSRTL equ  _XMODSRT
  XMODSRTH equ  _XMODSRT+1
  XMODENDL equ  _XMODEND
  XMODENDH equ  _XMODEND+1
  YMODSRTL equ  _YMODSRT
  YMODSRTH equ  _YMODSRT+1
  YMODENDL equ  _YMODEND
  YMODENDH equ  _YMODEND+1
  XBREVL equ  _XBREV
  XBREVH equ  _XBREV+1
  DISICNTL equ  _DISICNT
  DISICNTH equ  _DISICNT+1
  CNEN1L equ  _CNEN1
  CNEN1H equ  _CNEN1+1
  CNPU1L equ  _CNPU1
  CNPU1H equ  _CNPU1+1
  INTCON1L equ  _INTCON1
  INTCON1H equ  _INTCON1+1
  INTCON2L equ  _INTCON2
  INTCON2H equ  _INTCON2+1
  IFS0L equ  _IFS0
  IFS0H equ  _IFS0+1
  IFS1L equ  _IFS1
  IFS1H equ  _IFS1+1
  IFS3L equ  _IFS3
  IFS3H equ  _IFS3+1
  IFS4L equ  _IFS4
  IFS4H equ  _IFS4+1
  IFS5L equ  _IFS5
  IFS5H equ  _IFS5+1
  IFS6L equ  _IFS6
  IFS6H equ  _IFS6+1
  IFS7L equ  _IFS7
  IFS7H equ  _IFS7+1
  IEC0L equ  _IEC0
  IEC0H equ  _IEC0+1
  IEC1L equ  _IEC1
  IEC1H equ  _IEC1+1
  IEC3L equ  _IEC3
  IEC3H equ  _IEC3+1
  IEC4L equ  _IEC4
  IEC4H equ  _IEC4+1
  IEC5L equ  _IEC5
  IEC5H equ  _IEC5+1
  IEC6L equ  _IEC6
  IEC6H equ  _IEC6+1
  IEC7L equ  _IEC7
  IEC7H equ  _IEC7+1
  IPC0L equ  _IPC0
  IPC0H equ  _IPC0+1
  IPC1L equ  _IPC1
  IPC1H equ  _IPC1+1
  IPC2L equ  _IPC2
  IPC2H equ  _IPC2+1
  IPC3L equ  _IPC3
  IPC3H equ  _IPC3+1
  IPC4L equ  _IPC4
  IPC4H equ  _IPC4+1
  IPC5L equ  _IPC5
  IPC5H equ  _IPC5+1
  IPC7L equ  _IPC7
  IPC7H equ  _IPC7+1
  IPC14L equ  _IPC14
  IPC14H equ  _IPC14+1
  IPC16L equ  _IPC16
  IPC16H equ  _IPC16+1
  IPC23L equ  _IPC23
  IPC23H equ  _IPC23+1
  IPC24L equ  _IPC24
  IPC24H equ  _IPC24+1
  IPC27L equ  _IPC27
  IPC27H equ  _IPC27+1
  IPC28L equ  _IPC28
  IPC28H equ  _IPC28+1
  INTTREGL equ  _INTTREG
  INTTREGH equ  _INTTREG+1
  TMR1L equ  _TMR1
  TMR1H equ  _TMR1+1
  PR1L equ  _PR1
  PR1H equ  _PR1+1
  T1CONL equ  _T1CON
  T1CONH equ  _T1CON+1
  TMR2L equ  _TMR2
  TMR2H equ  _TMR2+1
  PR2L equ  _PR2
  PR2H equ  _PR2+1
  T2CONL equ  _T2CON
  T2CONH equ  _T2CON+1
  OC1RSL equ  _OC1RS
  OC1RSH equ  _OC1RS+1
  OC1RL equ  _OC1R
  OC1RH equ  _OC1R+1
  OC1CONL equ  _OC1CON
  OC1CONH equ  _OC1CON+1
  I2C1RCVL equ  _I2C1RCV
  I2C1RCVH equ  _I2C1RCV+1
  I2CRCVL equ  _I2CRCV
  I2CRCVH equ  _I2CRCV+1
  I2C1TRNL equ  _I2C1TRN
  I2C1TRNH equ  _I2C1TRN+1
  I2CTRNL equ  _I2CTRN
  I2CTRNH equ  _I2CTRN+1
  I2C1BRGL equ  _I2C1BRG
  I2C1BRGH equ  _I2C1BRG+1
  I2C1CONL equ  _I2C1CON
  I2C1CONH equ  _I2C1CON+1
  I2CCONL equ  _I2CCON
  I2CCONH equ  _I2CCON+1
  I2C1STATL equ  _I2C1STAT
  I2C1STATH equ  _I2C1STAT+1
  I2CSTATL equ  _I2CSTAT
  I2CSTATH equ  _I2CSTAT+1
  I2C1ADDL equ  _I2C1ADD
  I2C1ADDH equ  _I2C1ADD+1
  I2CADDL equ  _I2CADD
  I2CADDH equ  _I2CADD+1
  I2C1MSKL equ  _I2C1MSK
  I2C1MSKH equ  _I2C1MSK+1
  U1MODEL equ  _U1MODE
  U1MODEH equ  _U1MODE+1
  U1STAL equ  _U1STA
  U1STAH equ  _U1STA+1
  U1TXREGL equ  _U1TXREG
  U1TXREGH equ  _U1TXREG+1
  U1RXREGL equ  _U1RXREG
  U1RXREGH equ  _U1RXREG+1
  U1BRGL equ  _U1BRG
  U1BRGH equ  _U1BRG+1
  SPI1STATL equ  _SPI1STAT
  SPI1STATH equ  _SPI1STAT+1
  SPI1CON1L equ  _SPI1CON1
  SPI1CON1H equ  _SPI1CON1+1
  SPI1CON2L equ  _SPI1CON2
  SPI1CON2H equ  _SPI1CON2+1
  SPI1BUFL equ  _SPI1BUF
  SPI1BUFH equ  _SPI1BUF+1
  TRISAL equ  _TRISA
  TRISAH equ  _TRISA+1
  PORTAL equ  _PORTA
  PORTAH equ  _PORTA+1
  LATAL equ  _LATA
  LATAH equ  _LATA+1
  ODCAL equ  _ODCA
  ODCAH equ  _ODCA+1
  TRISBL equ  _TRISB
  TRISBH equ  _TRISB+1
  PORTBL equ  _PORTB
  PORTBH equ  _PORTB+1
  LATBL equ  _LATB
  LATBH equ  _LATB+1
  ODCBL equ  _ODCB
  ODCBH equ  _ODCB+1
  ADCONL equ  _ADCON
  ADCONH equ  _ADCON+1
  ADPCFGL equ  _ADPCFG
  ADPCFGH equ  _ADPCFG+1
  ADSTATL equ  _ADSTAT
  ADSTATH equ  _ADSTAT+1
  ADBASEL equ  _ADBASE
  ADBASEH equ  _ADBASE+1
  ADCPC0L equ  _ADCPC0
  ADCPC0H equ  _ADCPC0+1
  ADCPC1L equ  _ADCPC1
  ADCPC1H equ  _ADCPC1+1
  ADCBUF0L equ  _ADCBUF0
  ADCBUF0H equ  _ADCBUF0+1
  ADCBUF1L equ  _ADCBUF1
  ADCBUF1H equ  _ADCBUF1+1
  ADCBUF2L equ  _ADCBUF2
  ADCBUF2H equ  _ADCBUF2+1
  ADCBUF3L equ  _ADCBUF3
  ADCBUF3H equ  _ADCBUF3+1
  ADCBUF6L equ  _ADCBUF6
  ADCBUF6H equ  _ADCBUF6+1
  ADCBUF7L equ  _ADCBUF7
  ADCBUF7H equ  _ADCBUF7+1
  PTCONL equ  _PTCON
  PTCONH equ  _PTCON+1
  PTCON2L equ  _PTCON2
  PTCON2H equ  _PTCON2+1
  PTPERL equ  _PTPER
  PTPERH equ  _PTPER+1
  SEVTCMPL equ  _SEVTCMP
  SEVTCMPH equ  _SEVTCMP+1
  MDCL equ  _MDC
  MDCH equ  _MDC+1
  PWMCON1L equ  _PWMCON1
  PWMCON1H equ  _PWMCON1+1
  IOCON1L equ  _IOCON1
  IOCON1H equ  _IOCON1+1
  FCLCON1L equ  _FCLCON1
  FCLCON1H equ  _FCLCON1+1
  PDC1L equ  _PDC1
  PDC1H equ  _PDC1+1
  PHASE1L equ  _PHASE1
  PHASE1H equ  _PHASE1+1
  DTR1L equ  _DTR1
  DTR1H equ  _DTR1+1
  ALTDTR1L equ  _ALTDTR1
  ALTDTR1H equ  _ALTDTR1+1
  SDC1L equ  _SDC1
  SDC1H equ  _SDC1+1
  SPHASE1L equ  _SPHASE1
  SPHASE1H equ  _SPHASE1+1
  TRIG1L equ  _TRIG1
  TRIG1H equ  _TRIG1+1
  TRGCON1L equ  _TRGCON1
  TRGCON1H equ  _TRGCON1+1
  STRIG1L equ  _STRIG1
  STRIG1H equ  _STRIG1+1
  PWMCAP1L equ  _PWMCAP1
  PWMCAP1H equ  _PWMCAP1+1
  LEBCON1L equ  _LEBCON1
  LEBCON1H equ  _LEBCON1+1
  PWMCON4L equ  _PWMCON4
  PWMCON4H equ  _PWMCON4+1
  IOCON4L equ  _IOCON4
  IOCON4H equ  _IOCON4+1
  FCLCON4L equ  _FCLCON4
  FCLCON4H equ  _FCLCON4+1
  PDC4L equ  _PDC4
  PDC4H equ  _PDC4+1
  PHASE4L equ  _PHASE4
  PHASE4H equ  _PHASE4+1
  DTR4L equ  _DTR4
  DTR4H equ  _DTR4+1
  ALTDTR4L equ  _ALTDTR4
  ALTDTR4H equ  _ALTDTR4+1
  SDC4L equ  _SDC4
  SDC4H equ  _SDC4+1
  SPHASE4L equ  _SPHASE4
  SPHASE4H equ  _SPHASE4+1
  TRIG4L equ  _TRIG4
  TRIG4H equ  _TRIG4+1
  TRGCON4L equ  _TRGCON4
  TRGCON4H equ  _TRGCON4+1
  STRIG4L equ  _STRIG4
  STRIG4H equ  _STRIG4+1
  PWMCAP4L equ  _PWMCAP4
  PWMCAP4H equ  _PWMCAP4+1
  LEBCON4L equ  _LEBCON4
  LEBCON4H equ  _LEBCON4+1
  RPINR0L equ  _RPINR0
  RPINR0H equ  _RPINR0+1
  RPINR1L equ  _RPINR1
  RPINR1H equ  _RPINR1+1
  RPINR2L equ  _RPINR2
  RPINR2H equ  _RPINR2+1
  RPINR3L equ  _RPINR3
  RPINR3H equ  _RPINR3+1
  RPINR11L equ  _RPINR11
  RPINR11H equ  _RPINR11+1
  RPINR18L equ  _RPINR18
  RPINR18H equ  _RPINR18+1
  RPINR20L equ  _RPINR20
  RPINR20H equ  _RPINR20+1
  RPINR21L equ  _RPINR21
  RPINR21H equ  _RPINR21+1
  RPINR29L equ  _RPINR29
  RPINR29H equ  _RPINR29+1
  RPINR30L equ  _RPINR30
  RPINR30H equ  _RPINR30+1
  RPINR31L equ  _RPINR31
  RPINR31H equ  _RPINR31+1
  RPINR32L equ  _RPINR32
  RPINR32H equ  _RPINR32+1
  RPINR33L equ  _RPINR33
  RPINR33H equ  _RPINR33+1
  RPINR34L equ  _RPINR34
  RPINR34H equ  _RPINR34+1
  RPOR0L equ  _RPOR0
  RPOR0H equ  _RPOR0+1
  RPOR1L equ  _RPOR1
  RPOR1H equ  _RPOR1+1
  RPOR2L equ  _RPOR2
  RPOR2H equ  _RPOR2+1
  RPOR3L equ  _RPOR3
  RPOR3H equ  _RPOR3+1
  RPOR16L equ  _RPOR16
  RPOR16H equ  _RPOR16+1
  RPOR17L equ  _RPOR17
  RPOR17H equ  _RPOR17+1
  RCONL equ  _RCON
  RCONH equ  _RCON+1
  OSCCONLL equ  _OSCCONL
  OSCCONLH equ  _OSCCONL+1
  OSCCONHL equ  _OSCCONH
  OSCCONHH equ  _OSCCONH+1
  CLKDIVL equ  _CLKDIV
  CLKDIVH equ  _CLKDIV+1
  PLLFBDL equ  _PLLFBD
  PLLFBDH equ  _PLLFBD+1
  OSCTUNL equ  _OSCTUN
  OSCTUNH equ  _OSCTUN+1
  LFSRL equ  _LFSR
  LFSRH equ  _LFSR+1
  REFOCONL equ  _REFOCON
  REFOCONH equ  _REFOCON+1
  ACLKCONL equ  _ACLKCON
  ACLKCONH equ  _ACLKCON+1
  NVMCONL equ  _NVMCON
  NVMCONH equ  _NVMCON+1
  NVMKEYL equ  _NVMKEY
  NVMKEYH equ  _NVMKEY+1
  PMD1L equ  _PMD1
  PMD1H equ  _PMD1+1
  PMD2L equ  _PMD2
  PMD2H equ  _PMD2+1
  PMD4L equ  _PMD4
  PMD4H equ  _PMD4+1
  PMD6L equ  _PMD6
  PMD6H equ  _PMD6+1
 C equ        0x0000
 Z equ        0x0001
 OV equ       0x0002
 N equ        0x0003
 RA equ       0x0004
 DC equ       0x0008
 DA equ       0x0009
 SAB equ      0x000A
 OAB equ      0x000B
 SB equ       0x000C
 SA equ       0x000D
 OB equ       0x000E
 OA equ       0x000F
 IPL0 equ     0x0005
 IPL1 equ     0x0006
 IPL2 equ     0x0007
 IF equ       0x0000
 RND equ      0x0001
 PSV equ      0x0002
 IPL3 equ     0x0003
 ACCSAT equ   0x0004
 SATDW equ    0x0005
 SATB equ     0x0006
 SATA equ     0x0007
 EDT equ      0x000B
 US equ       0x000C
 DL0 equ      0x0008
 DL1 equ      0x0009
 DL2 equ      0x000A
 YMODEN equ   0x000E
 XMODEN equ   0x000F
 XWM0 equ     0x0000
 XWM1 equ     0x0001
 XWM2 equ     0x0002
 XWM3 equ     0x0003
 YWM0 equ     0x0004
 YWM1 equ     0x0005
 YWM2 equ     0x0006
 YWM3 equ     0x0007
 BWM0 equ     0x0008
 BWM1 equ     0x0009
 BWM2 equ     0x000A
 BWM3 equ     0x000B
 BREN equ     0x000F
 XB0 equ      0x0000
 XB1 equ      0x0001
 XB2 equ      0x0002
 XB3 equ      0x0003
 XB4 equ      0x0004
 XB5 equ      0x0005
 XB6 equ      0x0006
 XB7 equ      0x0007
 XB8 equ      0x0008
 XB9 equ      0x0009
 XB10 equ     0x000A
 XB11 equ     0x000B
 XB12 equ     0x000C
 XB13 equ     0x000D
 XB14 equ     0x000E
 CN0IE equ    0x0000
 CN1IE equ    0x0001
 CN2IE equ    0x0002
 CN3IE equ    0x0003
 CN4IE equ    0x0004
 CN5IE equ    0x0005
 CN6IE equ    0x0006
 CN7IE equ    0x0007
 CN0PUE equ   0x0000
 CN1PUE equ   0x0001
 CN2PUE equ   0x0002
 CN3PUE equ   0x0003
 CN4PUE equ   0x0004
 CN5PUE equ   0x0005
 CN6PUE equ   0x0006
 CN7PUE equ   0x0007
 OSCFAIL equ  0x0001
 STKERR equ   0x0002
 ADDRERR equ  0x0003
 MATHERR equ  0x0004
 DIV0ERR equ  0x0006
 SFTACERR equ  0x0007
 COVTE equ    0x0008
 OVBTE equ    0x0009
 OVATE equ    0x000A
 COVBERR equ  0x000B
 COVAERR equ  0x000C
 OVBERR equ   0x000D
 OVAERR equ   0x000E
 NSTDIS equ   0x000F
 INT0EP equ   0x0000
 INT1EP equ   0x0001
 INT2EP equ   0x0002
 DISI equ     0x000E
 ALTIVT equ   0x000F
 INT0IF equ   0x0000
 OC1IF equ    0x0002
 T1IF equ     0x0003
 T2IF equ     0x0007
 SPI1EIF equ  0x0009
 SPI1IF equ   0x000A
 U1RXIF equ   0x000B
 U1TXIF equ   0x000C
 ADIF equ     0x000D
 SI2C1IF equ  0x0000
 MI2C1IF equ  0x0001
 CNIF equ     0x0003
 INT1IF equ   0x0004
 INT2IF equ   0x000D
 PSEMIF equ   0x0009
 U1EIF equ    0x0001
 PWM1IF equ   0x000E
 PWM4IF equ   0x0001
 ADCP0IF equ  0x000E
 ADCP1IF equ  0x000F
 ADCP3IF equ  0x0001
 INT0IE equ   0x0000
 OC1IE equ    0x0002
 T1IE equ     0x0003
 T2IE equ     0x0007
 SPI1EIE equ  0x0009
 SPI1IE equ   0x000A
 U1RXIE equ   0x000B
 U1TXIE equ   0x000C
 ADIE equ     0x000D
 SI2C1IE equ  0x0000
 MI2C1IE equ  0x0001
 CNIE equ     0x0003
 INT1IE equ   0x0004
 INT2IE equ   0x000D
 PSEMIE equ   0x0009
 U1EIE equ    0x0001
 PWM1IE equ   0x000E
 PWM4IE equ   0x0001
 ADCP0IE equ  0x000E
 ADCP1IE equ  0x000F
 ADCP3IE equ  0x0001
